app/views/songs/show.html.erb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
---
<br>
<% if @song.artist.blank?  %>